tap 'Homebrew/bundle'

cask_args appdir: "/Applications"
tap "homebrew/cask"

# cask apps
# cask "iterm2"
# cask "vanilla"
cask "ngrok"
cask "dropbox"
# cask "postman"
# cask "visual-studio-code"
# cask "nvalt"
# cask "vox"
# cask "karabiner"
# cask "google-chrome"
# cask "slack"
# cask "vlc"
#
# cask "intellij-idea-ce"
# cask "eclipse-ide"

# fonts
tap "caskroom/fonts"
cask "font-fira-code"
cask "font-source-code-pro"
cask "font-iosevka"

# for dotfiles
tap "thoughtbot/formulae"
brew "rcm"

brew "bash"
brew "bash-completion"
brew "dash"
brew "ctags"
brew "dfu-util"
brew "cowsay"
brew "cmatrix"
brew "sl"
brew "bat"
brew "tree"
brew "fzf"
brew "zsh-completions"
brew "zsh"
brew "ranger"
brew "tmux"
brew "wifi-password"
brew "ripgrep"
brew "reattach-to-user-namespace"
brew "neovim"
brew "mosh"
brew "git"
brew "htop"
brew "gotop"
brew "jq"
brew "wget"
brew "youtube-dl"
brew "tokei"
brew "noti"
brew "entr"
brew "devd"
# brew "just"
# brew "pgcli"



# asdf dependencies - todo: do I need these?
# brew "coreutils"
# brew "automake"
# brew "autoconf"
# brew "openssl"
# brew "libyaml"
# brew "readline"
# brew "libxslt"
# brew "libtool"
# brew "unixodbc"
brew "asdf"

brew "mas" # Apple App Store integration
mas "amphetamine", id: 937984704
mas "Be Focused", id: 973134470
mas "LastPass", id: 926036361
# slack,
# chrome,
# vs code/atom,
# vlc,
# karabiner,
# pocket,
# postico,
# skype,
#
# p4merge
# nvalt
# vox
