tap 'Homebrew/bundle'
tap 'cjbassi/gotop'

cask_args appdir: "/Applications"
tap "homebrew/cask"

# cask apps
# cask "iterm2"
# cask "vanilla"
cask "ngrok"
cask "dropbox"
cask "karabiner-elements"
cask "qlstephen" #quicklook for text files (without dedicated plugin)
cask "qlcolorcode" # quicklook for code with synta highlighting
cask "qlmarkdown" # quicklook markdown
cask "kitty" # fast terminal emulator
# cask "postman"
# cask "visual-studio-code"
# cask "nvalt"
# cask "vox"
# cask "google-chrome"
# cask "slack"
# cask "vlc"
#
# cask "intellij-idea-ce"
# cask "eclipse-ide"

# fonts
tap "caskroom/fonts"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"

# for dotfiles
tap "thoughtbot/formulae"
brew "rcm"

brew "bash"
brew "bash-completion"
brew "dash" # faster bash for scripting
# brew "ctags"
brew "dfu-util" # for keyboard
brew "cowsay"
brew "cmatrix" # the matrix
brew "sl" # a train
brew "bat" # cat, but with syntax highlights
brew "tree" # ls, but as a tree
brew "fzf" # fuzzy search
brew "zsh-completions"
brew "zsh"
brew "ranger" # file browser
brew "tmux"
brew "wifi-password"
brew "ripgrep" # super fast txt file search
brew "reattach-to-user-namespace" # for tmux
brew "neovim"
brew "mosh" # better ssh
brew "git"
brew "htop"
brew "gotop"
brew "jq"  # json format (json | jq .)
brew "wget"
brew "youtube-dl"
brew 'hyperfine' # rust benchmark tool
brew "tokei" # statitics on codebase
brew "noti"  # push cli results to notification
brew "entr"  # autorun stuff on changes
brew "devd"  # local webserver with live reload (devd -ol .)
brew "wrk"   # http benchmarking and load tool
brew "moreutils"
# brew "just"
# brew "pgcli"



# asdf dependencies - todo: do I need these?
brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "unzip"
brew "curl"
brew "asdf"
# additional erlang dependencies
brew "wxmac"

brew "mas" # Apple App Store integration
mas "amphetamine", id: 937984704
mas "Be Focused", id: 973134470
mas "LastPass", id: 926036361
# slack,
# chrome,
# vs code/atom,
# vlc,
# iina
# postico,
# skype,
#
# p4merge
# nvalt
