tap 'Homebrew/bundle'

cask_args appdir: "/Applications"
tap "homebrew/cask"

# cask apps
cask "iterm2"
cask "vanilla"
cask "ngrok"
cask "dropbox"
# cask "postman"
# cask "visual-studio-code"
# cask "nvalt"
# cask "vox"
# cask "karabiner"
# cask "google-chrome"
# cask "slack"
# cask "vlc"
#
# cask "intellij-idea-ce"
# cask "eclipse-ide"

# fonts
tap "caskroom/fonts"
cask "font-fira-code"
cask "font-source-code-pro"
cask "font-iosevka"

# for dotfiles
tap "thoughtbot/formulae"
brew "rcm"

brew "bash"
brew "bash-completion"
brew "dash" # faster bash for scripting
# brew "ctags"
brew "dfu-util" # for keyboard
brew "cowsay"
brew "cmatrix" # the matrix
brew "sl" # a train
brew "bat" # cat, but with syntax highlights
brew "tree" # ls, but as a tree
brew "fzf" # fuzzy search
brew "zsh-completions"
brew "zsh"
brew "ranger" # file browser
brew "tmux"
brew "wifi-password"
brew "ripgrep" # super fast txt file search
brew "reattach-to-user-namespace" # for tmux
brew "neovim"
brew "mosh" # better ssh
brew "git"
brew "htop"
brew "gotop"
brew "jq"  # json format (json | jq .)
brew "wget"
brew "youtube-dl"
brew "tokei" # statitics on codebase
brew "noti"  # push cli results to notification
brew "entr"  # autorun stuff on changes
brew "devd"  # local webserver with live reload (devd -ol .)
# brew "just"
# brew "pgcli"



# asdf dependencies - todo: do I need these?
# brew "coreutils"
# brew "automake"
# brew "autoconf"
# brew "openssl"
# brew "libyaml"
# brew "readline"
# brew "libxslt"
# brew "libtool"
# brew "unixodbc"
brew "asdf"

brew "mas" # Apple App Store integration
mas "amphetamine", id: 937984704
mas "Be Focused", id: 973134470
mas "LastPass", id: 926036361
# slack,
# chrome,
# vs code/atom,
# vlc,
# karabiner,
# pocket,
# postico,
# skype,
#
# p4merge
# nvalt
# vox
